Конфигурация/Reports/РегламентированныйОтчетБалансРСБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>РегламентированныйОтчетБалансРСБУ</Name>
		</Properties>
	</Report>
</MetaDataObject>

Конфигурация/InformationRegisters/КонтактныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КонтактныеЛица</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОснованиеПолномочий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ПорядкиОкругленияОтчетности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ПорядкиОкругленияОтчетности</Name>
			<Comment>Порядки округления отчетности</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Окр1</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр1000</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр1000000</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Reports/РегламентированныйОтчетБалансРСБУ/Forms/НастройкиОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Организация 					= Параметры.Организация;
	ЭтаФорма.СчетДоверительногоУправления	= Параметры.СчетДоверительногоУправления;
	ЭтаФорма.ЕдиницаИзмерения 				= Параметры.ЕдиницаИзмерения;
	ЭтаФорма.ТочностьЕдиницыИзмерения 		= Параметры.ТочностьЕдиницыИзмерения;
	ЭтаФорма.ВалютаДокумента 				= Параметры.ВалютаДокумента;
	ЭтаФорма.ОтчетНаКонецПрошлогоГода 		= Параметры.ОтчетНаКонецПрошлогоГода;
	ЭтаФорма.ОтчетНаКонецПозапрошлогоГода 	= Параметры.ОтчетНаКонецПозапрошлогоГода;
	ЭтаФорма.Подписант 						= Параметры.Подписант;
	ЭтаФорма.ПодписантБухгалтер				= Параметры.ПодписантБухгалтер;
	ЭтаФорма.ИсточникОтчета					= Параметры.ИсточникОтчета;
	ЭтаФорма.ВыбраннаяФорма					= Параметры.ВыбраннаяФорма;

КонецПроцедуры

&НаКлиенте
Процедура ПодписантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Параметрыформы = РаботаСОтчетами.ПолучитьПараметрыФормыВыбораКонтактногоЛица(Новый Структура("Организация, КонтактноеЛицо", ЭтаФорма.Организация, ЭтаФорма.Подписант));
	
	ОткрытьФормуМодально("РегистрСведений.КонтактныеЛица.ФормаСписка", ПараметрыФормы, Элемент, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(ВыбранноеЗначение);
	
	ЭтаФорма.Подписант = СтруктураДанныхКонтактногоЛица.КонтактноеЛицо;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	СохранитьДанные();
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДанные()
	
	ВладелецФормы.СтруктураРеквизитовФормы.ЕдиницаИзмерения 				= ЭтаФорма.ЕдиницаИзмерения;
	ВладелецФормы.СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения 		= ЭтаФорма.ТочностьЕдиницыИзмерения;
	ВладелецФормы.СтруктураРеквизитовФормы.ВалютаДокумента 					= ЭтаФорма.ВалютаДокумента;
	ВладелецФормы.СтруктураРеквизитовФормы.ОтчетНаКонецПрошлогоГода 		= ЭтаФорма.ОтчетНаКонецПрошлогоГода;
	ВладелецФормы.СтруктураРеквизитовФормы.ОтчетНаКонецПозапрошлогоГода		= ЭтаФорма.ОтчетНаКонецПозапрошлогоГода;
	ВладелецФормы.Подписант	= ЭтаФорма.Подписант;
	ВладелецФормы.ПодписантБухгалтер	= ЭтаФорма.ПодписантБухгалтер;
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзменении(Элемент)
	
	ЗаполнитьСписокЕдиницИзмерения();
	
КонецПроцедуры

&НаКлиенте 
Процедура ЗаполнитьСписокЕдиницИзмерения()

	Элементы.ЕдиницаИзмерения.СписокВыбора.Очистить();
	
	ПредставлениеВалютыДокумента = ?(ЗначениеЗаполнено(ВалютаДокумента), ВалютаДокумента, "руб");
	
	Порядок1       = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1");
	Порядок1000    = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1000");
	Порядок1000000 = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1000000");
	
	// Список выбора поля "Единица измерения"
	Элементы.ЕдиницаИзмерения.СписокВыбора.Добавить(Порядок1,       "в " + ПредставлениеВалютыДокумента);
	Элементы.ЕдиницаИзмерения.СписокВыбора.Добавить(Порядок1000,    "в тысячах " + ПредставлениеВалютыДокумента);
	Элементы.ЕдиницаИзмерения.СписокВыбора.Добавить(Порядок1000000, "в миллионах " + ПредставлениеВалютыДокумента);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьСписокЕдиницИзмерения()
КонецПроцедуры


&НаКлиенте
Процедура ПодписантБухгалтерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Параметрыформы = РаботаСОтчетами.ПолучитьПараметрыФормыВыбораКонтактногоЛица(Новый Структура("Организация, КонтактноеЛицо", ЭтаФорма.Организация, ЭтаФорма.ПодписантБухгалтер));
	
	ОткрытьФормуМодально("РегистрСведений.КонтактныеЛица.ФормаСписка", ПараметрыФормы, Элемент, ЭтаФорма);
КонецПроцедуры


&НаКлиенте
Процедура ПодписантБухгалтерОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(ВыбранноеЗначение);
	
	ЭтаФорма.ПодписантБухгалтер = СтруктураДанныхКонтактногоЛица.КонтактноеЛицо;
КонецПроцедуры
